In [2]:
import pandas as pd

In [7]:
table = pd.read_csv("Matriculados.csv", sep=";")

In [8]:
table.head()

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [11]:
table["nome"]

0    Maria
1    Pedro
2    Pablo
3    Joana
Name: nome, dtype: object

In [13]:
columns = ['nome', 'peso']
table[columns]

    nome  peso
0  Maria    71
1  Pedro    33
2  Pablo    90
3  Joana    58

In [18]:
table.iloc[1:3,:]

    nome  idade  peso altura sexo
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M

In [19]:
table.iloc[:,:3]

    nome  idade  peso
0  Maria     20    71
1  Pedro      8    33
2  Pablo     46    90
3  Joana     83    58

In [20]:
n_kids = [0,2,0,1] # Vetor de quantidade de filhos
table['filhos'] = n_kids
table

    nome  idade  peso altura sexo  filhos
0  Maria     20    71   1,64    F       0
1  Pedro      8    33    1,2    M       2
2  Pablo     46    90    1,9    M       0
3  Joana     83    58   1,54    F       1

In [22]:
table2 = table.drop(["filhos"], axis=1)
table2

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [23]:
table

    nome  idade  peso altura sexo  filhos
0  Maria     20    71   1,64    F       0
1  Pedro      8    33    1,2    M       2
2  Pablo     46    90    1,9    M       0
3  Joana     83    58   1,54    F       1